## TARGET GUIDED ORDINAL ENCODING

It is a technique used to encode categorical variables based on their relationship with the target variable.

We replace categorical values with the mean or median of target variable

In [1]:
import pandas as pd

# create a sample dataframe with a categorical variable and a target variable
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'New York', 'Paris'],
    'price': [200, 150, 300, 250, 180, 320]
})

In [2]:
df.head()

       city  price
0  New York    200
1    London    150
2     Paris    300
3     Tokyo    250
4  New York    180

In [5]:
df.groupby('city')['price'].mean()  ##finding mean price of corresponding countries

city
London      150.0
New York    190.0
Paris       310.0
Tokyo       250.0
Name: price, dtype: float64

In [8]:
mean_price = df.groupby('city')['price'].mean().to_dict()

In [9]:
mean_price

{'London': 150.0, 'New York': 190.0, 'Paris': 310.0, 'Tokyo': 250.0}

In [10]:
df['city encoded'] = df['city'].map(mean_price)

In [13]:
df[['city encoded','price']]

   city encoded  price
0         190.0    200
1         150.0    150
2         310.0    300
3         250.0    250
4         190.0    180
5         310.0    320

#### convert time with respect to total bill of tips dataset

In [14]:
import seaborn as sns

In [15]:
df = sns.load_dataset('tips')

In [16]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [19]:
mean_total_bill=df.groupby('time')['total_bill'].mean().to_dict()

In [20]:
mean_total_bill

{'Lunch': 17.168676470588235, 'Dinner': 20.79715909090909}

In [21]:
df['time_encoded'] = df['time'].map(mean_total_bill)

In [22]:
df[['time_encoded']]

    time_encoded
0      20.797159
1      20.797159
2      20.797159
3      20.797159
4      20.797159
..           ...
239    20.797159
240    20.797159
241    20.797159
242    20.797159
243    20.797159

[244 rows x 1 columns]